modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_multiplesignatures2.xml

<!--
    Warehouse service list products request with body signed by Bob and Bob's signature signed by Alice
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-11DA83020116EB58C5152271599010987">MIICgjCCAWqgAwIBAgIJALLt3UmjdE/TMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjMxNjIxWhgPMjExODAzMDIyMzE2MjFaMEIxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIUJPCtG7JthGRmQ8G1iryHRwCaU7aBRNqPl5dakkUsyoZLQ/ZBp7pOor6PnP/8l2FwF39bT8cR2lo2CqQqZ2UE7lCVq0Iz210U8Z1I7BcZw/ucEFhYE3NBsrXmI1eMTe9hwdvqvCmN48SWK1T4LaeYNN+P+QUSnkSEm8MvFQMiPAgMBAAGjDzANMAsGA1UdDwQEAwIEsDANBgkqhkiG9w0BAQUFAAOCAQEAFFJdESl83b5ChMRW6xfJJsfvG+Hdi55Ppgz98gKgoYMewX4dGAbaELLxeGH1iWvtuvUjxW4jEBkoV5iVtKDVwwJElt/mOFTnTguhdd/OJYDnNtVQd+URvk6QnG8tAvoKQxqsp6DSrs81W/pWVXMXe3xektcfq+NlGl1ylbmsj+oFd+XfiZbKKfE9YU4Q9oGs48T70a4uvIRhyaswZlO1vu+QNHHss40mwrhZV9s1QEOV8+l1EiyornIOQLVX/mQoBY+2wh5I5G7IzZp6oWA+L578D5KI84Yh4xXKR5+1r4P1+yCDNxIO6J+Iyizb5cEEcaS25Qw6GMUuVd/KKYqUWw==</wsse:BinarySecurityToken><ds:Signature Id="SIG-11DA83020116EB58C5152271599010991" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-11DA83020116EB58C5152271599010990"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="wsse wsu soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>WvuQjte441y6sHk0xeynhdZR79U=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Jz0X+zguYi3cm2WT+y8UfPrN05I/gdLP4hwaFaeyQS7r71dr7B6D3zT11njFwS3s4CFPnqiyg4ug
Eca3yfw9t2D4GO9jfLKufTm/MBsEE9+yKwZliv01zlwJRxH68HJXKzgOfxvnWsf4094RmrJnlIYk
6mcvMldvDHwQklHM84I=</ds:SignatureValue><ds:KeyInfo Id="KI-11DA83020116EB58C5152271599010988"><wsse:SecurityTokenReference wsu:Id="STR-11DA83020116EB58C5152271599010989"><wsse:Reference URI="#X509-11DA83020116EB58C5152271599010987" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-11DA83020116EB58C5152271599009982">MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAzMDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTEjeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpWEYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+nQkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y90JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm87TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqidNNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3HUFY09XXtTrXgeOyBUpVlmA=</wsse:BinarySecurityToken><ds:Signature Id="SIG-11DA83020116EB58C5152271599009986" wsu:Id="id-11DA83020116EB58C5152271599010990" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-11DA83020116EB58C5152271599009985"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>l79Qj9qemz1tym1rjQ1Ycz/sVsM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>mvADlKvgCl6RRobzO0AzogpK3puzShh6ODiHputy6KTbSjahHOhqHqMcRXt9Y/4mxPEUyQsWMwx6
8lz5Q22Otz84iuna2+fh9bFz2f0SvnwP5aUN0lRAPs5MkaeUHPVqxhtl6YxO0b/tqTOL0OStwMfq
+3W2FUO7vDJabW2IUvo=</ds:SignatureValue><ds:KeyInfo Id="KI-11DA83020116EB58C5152271599009983"><wsse:SecurityTokenReference wsu:Id="STR-11DA83020116EB58C5152271599009984"><wsse:Reference URI="#X509-11DA83020116EB58C5152271599009982" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-11DA83020116EB58C5152271599009985" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>