modules/common/src/test/resources/com/l7tech/common/resources/bug7157_signatureCombination.xml

<!--
  Message composed of parts of two original signed messages.
  Note that the 2nd signature now references the BST from the 1st message
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" actor="secure_span" soapenv:mustUnderstand="1">
<wsu:Timestamp wsu:Id="Timestamp-1-a7ec2be66fa2e35cff5fc58899ae3cf5"><wsu:Created>2009-04-29T18:54:40.203226571Z</wsu:Created><wsu:Expires>2009-04-29T18:59:40.203Z</wsu:Expires></wsu:Timestamp>
<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="BinarySecurityToken-0-cfd4005ecfdc1132e2d890c1c189d2dd">MIIBoDCCAUqgAwIBAgIIOZnsTJQgnDEwDQYJKoZIhvcNAQEFBQAwEDEOMAwGA1UEAwwFdXNlcjEwIBcNMDkwNDI5MTg0NDM1WhgPNDc0OTAzMjYyMjIyMDFaMBAxDjAMBgNVBAMMBXVzZXIxMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCJLPt3WVA2XnGmR0nnkIv/chdJLbffqfVnM3cbLo9o4DMqBY3qdZf7XQ8pELdZI0qbMbIR0Ax22fltVpN2rQF+BMvxaPRNfx+v7grt+42OI8iqixxR+WQrLMWlfd+NbbdzYZeToK8xu9Ct10+T1HNweYb+LWLl/yuKHqAU1bV87QIDAQABo0IwQDAdBgNVHQ4EFgQUZyceKR/lCN/9ALIk8j9xzTuMSdkwHwYDVR0jBBgwFoAUZyceKR/lCN/9ALIk8j9xzTuMSdkwDQYJKoZIhvcNAQEFBQADQQAAAf//////////////////////////////////ADAhMAkGBSsOAwIaBQAEFFc7EB1noNm6TC7Xoo2nDhKSuaFf</wsse:BinarySecurityToken>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#Timestamp-1-a7ec2be66fa2e35cff5fc58899ae3cf5"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>0k/8PXev9w5vk6Fwi9mR8Jd0uG4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>SoMJJDgP4Vi+8ukQd2PX14gjVeWuNk27/8AOPuzccnu1OCmMCmXnvDVgsBMDUUZ652gpp2gdw79Fn9W8x5HUyM6VbLmvjaBJ6dZjaNKlzXzckjg64NkV/lQD0MYOTMKzVOVfeKOgVbw/bNsmsQWL63qb/WZRyO0vCb7ezHRNbSM=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#BinarySecurityToken-0-cfd4005ecfdc1132e2d890c1c189d2dd" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#Timestamp-1-a529ec39dc685d950593eae3f9e25455"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>0dzV9TGIaHoojBaQM30oO7ZjYBg=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Nj4ji7+RK2rx7mOyjz+7K8ARuP0Hqv7NDWXVqjykH2a00jf//PFbWlaczjDFg9PQ7pWb9B3MSKOJ26Ssw+XvhmfFQ1k5J3M+mHuOsz7YnDY8Ci1O3u6aizgyn+IciJ6OdELrSgqN3t5t2oOAcM9yzOSsu1xBCDEh6OBIgA/Xcv0=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#BinarySecurityToken-0-cfd4005ecfdc1132e2d890c1c189d2dd" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature>
</wsse:Security>
<OTHER  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" >
<wsu:Timestamp wsu:Id="Timestamp-1-a529ec39dc685d950593eae3f9e25455"><wsu:Created>2009-04-29T18:54:35.383579294Z</wsu:Created><wsu:Expires>2009-04-29T18:59:35.383Z</wsu:Expires></wsu:Timestamp>
</OTHER>
</soapenv:Header>
    <soapenv:Body>
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws">
            <tns:delay>0</tns:delay>
        </tns:listProducts>
    </soapenv:Body>
</soapenv:Envelope>
